Reports/ВедомостьАмортизацииОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииОСНалоговыйУчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДооценокОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НалоговыеНазначенияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НалоговыеНазначенияОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимостьНУ</Name>
					<Comment>Первоначальная стоимость для НУ (на 01.01.2002 или на момент ввода в эксплуатацию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяГруппаОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппыОсновныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬУчитываетсяКакЗапасНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬНеУчитываетсяКакОСНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИспользованияДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ВедомостьАмортизацииОСНалоговыйУчет/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "Организация", Организация);
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		ОтчетПоДокументу = Ложь;
		
	КонецЕсли;
	
	Если ОтчетПоДокументу Тогда
		
		МоментДокумента = Документ.МоментВремени();
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачГраница", МоментДокумента);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонГраница", МоментДокумента);
		
		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("СубконтоОС" , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйСубконто.Значение КАК ОС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
		|ГДЕ
		|	ХозрасчетныйСубконто.Вид = &СубконтоОС
		|	И ХозрасчетныйСубконто.Регистратор = &Регистратор";
		СписокОС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОС");
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС = Неопределено Тогда
			
			ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Добавить("ОсновноеСредство");	
			
		КонецЕсли;
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Истина;
			ОтборПоОС.ВидСравнения  = ВидСравнения.ВСписке;         
			ОтборПоОС.Значение.ЗагрузитьЗначения(СписокОС);
			
		КонецЕсли;
		
	Иначе
		
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачДата"   , ОбщийОтчет.ДатаНач);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонДата"   , КонецДня(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачГраница", ОбщийОтчет.ДатаНач);
		
		Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", Неопределено);
			
		Иначе
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", КонецДня(ОбщийОтчет.ДатаКон));
			
		КонецЕсли;
	
	КонецЕсли; 
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);
	
	Если ОтчетПоДокументу Тогда
		// Очищается отбор	
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Ложь;
			ОтборПоОС.ВидСравнения  = ВидСравнения.Равно;         
			ОтборПоОС.Значение      = Справочники.ОсновныеСредства.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Стоимость.Организация                                   КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Организация)                    КАК ОрганизацияПредставление,
	|	Стоимость.Счет                                          КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Счет)                           КАК СчетУчетаПредставление,
	|	Стоимость.НалоговоеНазначение                           КАК НалоговоеНазначение,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.НалоговоеНазначение)            КАК НалоговоеНазначениеПредставление,
	|	Стоимость.Субконто1                                     КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Субконто1)                      КАК ОсновноеСредствоПредставление,
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию                   КАК ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета                         КАК ДатаСнятияСУчета,
	|	СУММА(Стоимость.СуммаНУНачальныйОстаток)                КАК СтоимостьНачальныйОстаток,
	|	СУММА(Стоимость.СуммаНУОборотДт)                        КАК СтоимостьОборотДт,
	|	СУММА(Амортизация.СуммаНУОборотКт)                      КАК АмортизацияОборот,
	|	СУММА(Стоимость.СуммаНУОборотКт)                        КАК СтоимостьОборотКт,
	|	СУММА(Стоимость.СуммаНУКонечныйОстаток)                 КАК СтоимостьКонечныйОстаток,
	|	ПервоначальныеСведения.НалоговаяГруппаОС                КАК НалоговаяГруппаОС,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.НалоговаяГруппаОС) КАК НалоговаяГруппаОСПредставление,
	|	ПервоначальныеСведенияБУ.ИнвентарныйНомер               КАК ИнвентарныйНомер,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования 		КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации,
	|	Стоимость.Субконто1.Код                                 КАК КодОС
	|{ВЫБРАТЬ
	|	Стоимость.Организация.*            КАК Организация,
	|	Стоимость.НалоговоеНазначение      КАК НалоговоеНазначение,
	|	Стоимость.Субконто1                КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(Стоимость.Субконто1.Изготовитель КАК Строка(1024))   КАК Изготовитель,
	|	ВЫРАЗИТЬ(Стоимость.Субконто1.НомерПаспорта КАК Строка(1024))  КАК НомерПаспорта,
	|	ВЫРАЗИТЬ(Стоимость.Субконто1.ЗаводскойНомер КАК Строка(1024)) КАК ЗаводскойНомер,
	|	Стоимость.Субконто1.ДатаВыпуска    КАК ДатаВыпуска,
	|	ВЫРАЗИТЬ(Стоимость.Субконто1.Модель КАК Строка(1024))         КАК Модель,
	|	ДатаВводаВЭксплуатацию             КАК ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета                   КАК ДатаСнятияСУчета,
	|	СчетУчета.*                        КАК СчетУчета,
	|	НалоговаяГруппаОС 				   КАК НалоговаяГруппаОС,
	|	ПервоначальныеСведенияБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Стоимость.Субконто1.Код            КАК КодОС,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации}
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , ,
	|	                   Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Стоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				НалоговыеНазначенияОС.Организация         КАК Организация,
	|				НалоговыеНазначенияОС.ОсновноеСредство    КАК ОсновноеСредство,
	|				НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение,
	|				ВЫБОР
	|					КОГДА НалоговыеНазначенияОС.НалоговоеНазначение = &НеОблНеХоз
	|						ТОГДА NULL
	|					ИНАЧЕ ПервоначальныеСведения.НалоговаяГруппаОС
	|				КОНЕЦ 			                   		  КАК НалоговаяГруппаОС
	|			ИЗ
	|				РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&ДатаКон,
	|                               Организация = &Организация
	|				                {ОсновноеСредство КАК ОсновноеСредство}) КАК НалоговыеНазначенияОС
	|					ЛЕВОЕ СОЕДИНЕНИЕ 
	|						РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|						                &ДатаКон, Организация = &Организация
	|										{ОсновноеСредство КАК ОсновноеСредство}) КАК ПервоначальныеСведения
	|					ПО НалоговыеНазначенияОС.Организация = ПервоначальныеСведения.Организация
	|					   И НалоговыеНазначенияОС.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство) КАК ПервоначальныеСведения
	|		ПО Стоимость.Организация = ПервоначальныеСведения.Организация
	|			И Стоимость.НалоговоеНазначение = ПервоначальныеСведения.НалоговоеНазначение
	|			И Стоимость.Субконто1 = ПервоначальныеСведения.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|				                &ДатаКон, Организация = &Организация
	|								{ОсновноеСредство КАК ОсновноеСредство}) КАК ПервоначальныеСведенияБУ
	|		ПО Стоимость.Организация = ПервоначальныеСведенияБУ.Организация
	|			И Стоимость.Субконто1 = ПервоначальныеСведенияБУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(
	|				                &ДатаКон, Организация = &Организация
	|								{ОсновноеСредство КАК ОсновноеСредство}) КАК ПараметрыАмортизацииОС
	|		ПО Стоимость.Организация = ПараметрыАмортизацииОС.Организация
	|			И Стоимость.Субконто1 = ПараметрыАмортизацииОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				СостоянияОС.Организация      КАК Организация,
	|				СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеВвода
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеСнятияСУчета
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаСнятияСУчета
	|			ИЗ
	|				РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|			ГДЕ
	|				СостоянияОС.Организация = &Организация
	|			{ГДЕ
	|				СостоянияОС.ОсновноеСредство}
	|		
	|			СГРУППИРОВАТЬ ПО
	|				СостоянияОС.Организация,
	|				СостоянияОС.ОсновноеСредство) КАК РегСостоянияОС
	|		ПО Стоимость.Организация = РегСостоянияОС.Организация
	|			И Стоимость.Субконто1 = РегСостоянияОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|		                       &НачГраница,
	|		                       &КонГраница, , ,
	|		                       Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Амортизация
	|		ПО Стоимость.Организация = Амортизация.Организация
	|			И Стоимость.Субконто1 = Амортизация.Субконто1
	|{ГДЕ
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию    КАК ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета          КАК ДатаСнятияСУчета,
	|	ПервоначальныеСведения.НалоговаяГруппаОС КАК НалоговаяГруппаОС,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации   		КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации   				КАК СтоимостьДляВычисленияАмортизации}
	|
	|СГРУППИРОВАТЬ ПО
	|	Стоимость.Организация,
	|	Стоимость.НалоговоеНазначение,
	|	Стоимость.Субконто1,
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета,
	|	Стоимость.Счет,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации,
	|	ПервоначальныеСведенияБУ.ИнвентарныйНомер,
	|	ПервоначальныеСведения.НалоговаяГруппаОС
	|{УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	НалоговоеНазначение,
	|	ОсновноеСредство,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьОборотДт,
	|	СтоимостьКонечныйОстаток,
	|	АмортизацияОборот,
	|	СтоимостьОборотКт,
	|	СчетУчета.*,
	|	ПараметрыАмортизацииОС.СрокПолезногоИспользования,
	|	ПараметрыАмортизацииОС.СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОС.СтоимостьДляВычисленияАмортизации,
	|	НалоговаяГруппаОС.*}
	|ИТОГИ
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(АмортизацияОборот),
	|	СУММА(СтоимостьОборотКт),
	|	СУММА(СтоимостьКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	Организация,
	|	НалоговоеНазначение,
	|	НалоговаяГруппаОС
	|{ИТОГИ ПО
	|	Организация,
	|	СчетУчета.*,
	|	НалоговоеНазначение,
	|	ОсновноеСредство,
	|	НалоговаяГруппаОС}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "Организация",                    НСтр("ru='Организация';uk='Організація'"));
	СтруктураПредставлениеПолей.Вставить( "ОрганизацияГоловнаяОрганизация", НСтр("ru='Головная организация';uk='Головна організація'"));
	СтруктураПредставлениеПолей.Вставить( "ОрганизацияЮрФизЛицо",           НСтр("ru='Юр. / физ. лицо';uk='Юр. / фіз. особа'"));
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",               НСтр("ru='Основное средство';uk='Основний засіб'"));
	СтруктураПредставлениеПолей.Вставить( "Изготовитель",                   НСтр("ru='Изготовитель';uk='Виробник'"));
	СтруктураПредставлениеПолей.Вставить( "НомерПаспорта",                  НСтр("ru='Номер паспорта ОС';uk='Номер паспорта ОЗ'"));
	СтруктураПредставлениеПолей.Вставить( "ЗаводскойНомер",                 НСтр("ru='Заводской номер ОС';uk='Заводський номер ОЗ'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВыпуска",                    НСтр("ru='Дата выпуска (постройки)';uk='Дата випуску (побудови)'"));
	СтруктураПредставлениеПолей.Вставить( "Модель",                         НСтр("ru='Модель, тип, марка';uk='Модель, тип, марка'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию",         НСтр("ru='Дата ввода в эксплуатацию';uk='Дата введення в експлуатацію'"));
	СтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета",         		НСтр("ru='Дата снятия с учета';uk='Дата зняття з обліку'"));
	СтруктураПредставлениеПолей.Вставить( "СчетУчета",         				НСтр("ru='Счет учета';uk='Рахунок'"));
	СтруктураПредставлениеПолей.Вставить( "ВидНалоговойДеятельности",       НСтр("ru='Вид налоговой деятельности';uk='Вид податкової діяльності'"));
	СтруктураПредставлениеПолей.Вставить( "НалоговаяГруппаОС",              НСтр("ru='Налоговая группа';uk='Податкова група'"));
	СтруктураПредставлениеПолей.Вставить( "КодОС",                          НСтр("ru='Код ОС';uk='Код ОЗ'"));
	
	СтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер", 				НСтр("ru='Инв. номер';uk='Інв. номер'"));
	
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток",      НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотДт",              НСтр("ru='Стоимость (приход)';uk='Вартість (надходження)'"));
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",              НСтр("ru='Амортизация за период';uk='Амортизація за період'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотКт",              НСтр("ru='Стоимость (расход)';uk='Вартість (витрата)'"));
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток",       НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"));

	СтруктураПредставлениеПолей.Вставить( "СтоимостьДляВычисленияАмортизации", НСтр("ru='Стоимость для амортизации';uk='Вартість для амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "СрокПолезногоИспользования"               , НСтр("ru='Срок полезного использования';uk='Строк корисного використання'"));
	СтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации", НСтр("ru='Срок исп. для амортизации';uk='Строк викор. для амортизації'"));
	СтруктураПредставлениеПолей.Вставить( "НалоговоеНазначение",            НСтр("ru='Налоговое назначение';uk='Податкове призначення'"));
	
	
	
	ПостроительОтчета.Текст     = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток",      НСтр("ru='Стоимость на начало периода';uk='Вартість на початок періоду'"),       Истина, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотДт",              НСтр("ru='Стоимость (приход)';uk='Вартість (надходження)'"),                Истина, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",              НСтр("ru='Амортизация за период';uk='Амортизація за період'"),             Истина, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотКт",              НСтр("ru='Стоимость (расход)';uk='Вартість (витрата)'"),                Ложь, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",       НСтр("ru='Стоимость на конец периода';uk='Вартість на кінець періоду'"),        Ложь, 	"ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("ОсновноеСредство");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ПостроительОтчета.Параметры.Вставить( "СостояниеСнятияСУчета", Перечисления.СостоянияОС.СнятоСУчета);
	ПостроительОтчета.Параметры.Вставить( "СубконтоОС"           , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	ПостроительОтчета.Параметры.Вставить( "НеОблНеХоз"           , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Добавляет в структуру общие для всех отчетов параметры настройки
//
// Параметры:
//	Нет.
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкиПостроителя", ОбщийОтчет.ПостроительОтчета.ПолучитьНастройки());
	СтруктураНастроек.Вставить("Показатели", ОбщийОтчет.Показатели.Выгрузить());
	СтруктураНастроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураНастроек.Вставить("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураНастроек.Вставить("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураНастроек.Вставить("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураНастроек.Вставить("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьСтруктуруДляСохраненияНастроек()()

// Заполняет из структуры настроек общие параметры отчетов
//
// Параметры:
//	Нет.
//
Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ПоказыватьЗаголовок) Экспорт
	Перем ТабПоказатели;
	
	Если ТипЗнч(ОбщийОтчет.СохраненныеНастройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
	
	СтруктураСНастройками.Свойство("Показатели", ТабПоказатели);
	Если ТипЗнч(ТабПоказатели) = Тип("ТаблицаЗначений") Тогда
		ОбщийОтчет.Показатели.Загрузить(ТабПоказатели);
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураСНастройками.Свойство("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураСНастройками.Свойство("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураСНастройками.Свойство("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураСНастройками.Свойство("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
КонецПроцедуры // ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки)()

ОбщийОтчет.ИмяРегистра          = "СтоимостьОС";
ОбщийОтчет.мНазваниеОтчета      = НСтр("ru='Ведомость по амортизации ОС (налоговый учет)';uk='Відомість по амортизації ОЗ (податковий облік)'");
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода   = 0;

#КонецЕсли
